# Калькулятор версия 1

# Переменная what  с запросом какую операцию делаем
what = input("Что делаем? (+, -): " )

# Переменная а через input и преобразование во float для корректного сложения и вычитания
a = float( input("Введи первое число: "))
# Переменная b через input и преобразование во float для корректного сложения и вычитания
b = float( input("Введи второе число: "))

# условия для выполнения операци с пеобразованием переменной c в str для правильной конкатенации

if what == "+":
    c = a + b
    print("Результат: " + str(c))
elif what == "-":
    c = a - b
    print("Результат: " + str(c))
else:
    print("Выбрана неверная операция")